Reddit_App/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-11-18 19:53:02.247373"], ["id", 6]]
---
    def reset_session_token
        self.session_token = generate_session_token
        self.save!

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_session_token
        token = SecureRandom::urlsafe_base64
        while User.exists?(session_token: token)